[
  {
    "raw_text": "8-Pack Blriet Aromatherapy Shower Steamers (Lavender Love) $3.99 + Free Shipping w/ Prime or on $35+. BLRIET via Amazon [amazon.com] has 8-Pack Blriet Aromatherapy Shower Steamers (Lavender Love) on sale for $9.99 - $6 off when you apply promo code 7UKMNRXR at checkout = $3.99. Shipping is free w/ Pri"
  },
  {
    "raw_text": "40\" Insignia F40 Series 1080p LED Fire Smart TV w/ Voice Remote $99 + Free Shipping. Best Buy via Amazon has 40\" Insignia F40 Series 1080p LED Fire Smart TV w/ Voice Remote (NS-40F401NA26) on sale for $99. Shipping is free.\r\n\r\nThanks to community member SUCHaDEAL for finding this"
  },
  {
    "raw_text": "AirPods for Under $100 — lowest price ever ahead of Prime Day. This sale is music to our ears."
  },
  {
    "raw_text": "TCL 2025 model Google Smart TVs now up to $1,500 off in early Prime Day sale, deals from $448. As part of its early Prime Big Deal Days sale, Amazon is now offering hundreds in savings on the 2025 TCL Google Smart TVs (actually as much as over $1,500 off on the higher-end models). Deals are starting down at $448 shipped right now and we have everything…"
  },
  {
    "raw_text": "Onyx BOOX P6 Pro phone-sized eReader with an E Ink color display and 5G launches Oct 9. The Onyx BOOX P6 Pro is a pocket-sized device that looks like a smartphone. And while it’s not actually a phone, it is the most phone-like product from Onyx BOOX to date. Over the past few years the company’s Onyx BOOX Palma line of pocket-sized eReaders have…"
  },
  {
    "raw_text": "Amazon Prime Day Deals 2025. Amazon Prime Day Deals 2025\n AMAZING sale prices and great deals October 7 and 8, 2025 for Amazon Prime Big Deals Days! Many times these deals are better than Black Friday and are the lowest prices of the year on so many items. Ready, set, shop! And don…"
  },
  {
    "raw_text": "This Super Mario Costume Is Cursed, But At Least It's Cheap Before Halloween. Mario riding Yoshi adult-sized costume \r\n $36 (was $100) \r\nSee at Amazon \r\nDonkey Kong adult-sized costume \r\n $58.70 (was $100) \r\nSee at Amazon \r\nBowser adult-sized costume \r\n $67.78 \r\nSee at Amazon \r\nHalloween is right around the corner, and if you want peop…"
  },
  {
    "raw_text": "Prime Day Turns Nintendo Switch Into a Steal, Excellent Renewed Model Hits Record Low on Amazon. Save as much as 33% when choosing to go with a refurbished model of the original Nintendo Switch.\nThe post Prime Day Turns Nintendo Switch Into a Steal, Excellent Renewed Model Hits Record Low on Amazon appeared first on Kotaku."
  },
  {
    "raw_text": "Kindle Unlimited’s Prime Day deal is here: Sign up now and get 3 months free. You read that right: three months of books for free."
  },
  {
    "raw_text": "Grab the M4 MacBook Air at a new low price at Amazon. Apple has dropped the price on its latest ultraportable MacBook to a record low $799 at Amazon ahead of Prime Day."
  },
  {
    "raw_text": "Paramount+ Lands ‘Discretion’ Starring Nicole Kidman & Elle Fanning With Straight-To-Series Order In Major Move For New Regime. EXCLUSIVE: Cindy Holland and her team have officially announced themselves to the TV marketplace by scooping up a big package with a big commitment in a big bidding war. In Paramount+’s first official greenlight since its parent company was acquired by Skydan…"
  },
  {
    "raw_text": "Walmart Is Granting Paid Members Early Access to Pokémon TCG Restocks Today, Here's What's Up for Grabs. Walmart+ members get early access on Oct 6 to the Pokémon Prismatic Evolutions Elite Trainer Box for $59.99, half off its regular price."
  },
  {
    "raw_text": "Logitech’s originally $130 G303 Shroud Edition wireless gaming mouse is down to $45 low today (65% off). As part of its ongoing Techtober sale, Best Buy is offering Logitech’s G303 Shroud Edition gaming mouse for $44.99 shipped. This is originally a $130 model that was fetching close to its full price at Amazon earlier this year before being phased out by newer …"
  },
  {
    "raw_text": "This Nespresso machine brews barista-quality coffee at home, and it's priced below $150 for Prime Day. Skip the coffee shop and save hundreds of dollars with this Nespresso machine for $70 off."
  },
  {
    "raw_text": "These Top-Rated Dyson OnTrac Headphones Are Now Half Off for Prime Day. That's right, these excellent headphones just dropped to a new all time low price -- make sure you don't miss out."
  },
  {
    "raw_text": "Deals: Google TV Streamer 4K, Moto Razr Ultra new low, $600 off Copilot+ PCs, MX Master 4, more. Amazon’s 2025 fall Prime Day sale is set to go live early tomorrow morning, but there already some new all-time low prices and notable discounts up for grabs in today’s 9to5toys Lunch Break. We have Motorola’s 2025 Razr Ultra flip phone now at the lowest pric…"
  },
  {
    "raw_text": "4-Pack Apple AirTags Bluetooth Tracking Device $65 + Free Shipping. Amazon has 4-Pack Apple AirTags on sale for $64.99. Shipping is free.\r\n\r\nBest Buy has 4-Pack Apple AirTags on sale for $64.99. Shipping is free.\r\n\r\nThanks to Deal Hunter phoinix and Community Member s"
  },
  {
    "raw_text": "Deals: AirPods 4 $90, AirPods Max $119 off, MacBook Air up to $600 off, AirTag from $16, MX Master 4, more. While we are still a little over 12 hours out from the official start to this year’s 2025 fall Prime Day sale at Amazon, today’s 9to5toys Lunch Break is already loaded with early Apple deals. Alongside the return of $200 price drop on M4 MacBook Air and up to…"
  },
  {
    "raw_text": "Best Amazon Prime Day headphones deals October 2025: Save on Beats, AirPods, Sony, and more. Amazon's October Prime Day kicks off tomorrow, but excellent deals are already available if you are looking for your next pair of headphones or earbuds."
  },
  {
    "raw_text": "Mistakes have been made - this gaming chair usually costs $949 but you can get it for $499 right now. The Alcantara version of the Fractal Refine, my favorite gaming chair, usually costs $949, but right now you can get it for nearly half that cost."
  },
  {
    "raw_text": "21-Piece Lapogy Plastic Crystal Look Christmas Tree Ornaments (Transparent, Snowflake) $2.29 + Free Shipping w/ Prime or on $35+. Buyology Inc via Amazon [amazon.com] has 21-Piece Lapogy Plastic Crystal Look Christmas Tree Ornaments (Transparent, Snowflake) on sale for $4.59 - an additional 50% = $2.29 when you apply codeOW3DM2D"
  },
  {
    "raw_text": "Books by Anne Bishop, Julia London, & More. Smart Bitches, Trashy Books"
  },
  {
    "raw_text": "Amazon’s clear-voice Fire TV Soundbar Plus falls to its best-ever price. A great soundbar can significantly improve your TV experience, especially if voices are difficult to comprehend or if you feel like movies and series sound weak on your current speakers. That’s exactly where Amazon’s Fire TV Soundbar Plus comes in, bringing a…"
  },
  {
    "raw_text": "Learning Resources New Sprouts Prep ‘n’ Store Kitchen Island – $47.99 (reg. $75). Amazon has the Learning Resources New Sprouts Prep ‘n’ Store Kitchen Island, Ages 2+, Play Food for Kids’ Kitchens, Grocery Store Pretend Play, Play Food For Toddlers,11 Pieces on sale for $47.99 (reg. $75). This is a great price for this item. Prepare Preten…"
  },
  {
    "raw_text": "Apple's Joining In the Prime Day Fun With $119 Off the AirPods Max Headphones. Don't miss your chance to pick up the fan-favorite Apple AirPods Max for just $430 right now at Amazon and Walmart."
  },
  {
    "raw_text": "Gorgeous Final Fantasy Art Book Box Set Is Nearly 50% Off For Prime Big Deal Days. The Sky: The Art of Final Fantasy Box Set \r\n $109 (was $200) \r\nGet deal at Amazon \r\nFinal Fantasy fans can save big on a beautiful three-book box set that celebrates the art of legendary designer and illustrator Yoshitaka Amano. Normally $200, The Sky: The Ar…"
  },
  {
    "raw_text": "Learning Resources Swirly Scoops Ice Cream Shoppe – $24.64 (reg. $40). Amazon has the Learning Resources Swirly Scoops Ice Cream Shoppe, Ice Scoop, Swirl Ice Cream Machine, Play Cones, Play Food, Toddler Food, Toddler Learning, Pretend Play, Preschool Toys, Pretend Kitchen Playset on sale for $25.64 (reg. $40). Countertop Ice Cr…"
  },
  {
    "raw_text": "We awarded the Dell 14 Plus our Editor's Choice - now it's on sale for $649. Dell's newest 14-inch laptop is currently $450 off - a sweet deal on an all-around, reliable workhorse we love."
  },
  {
    "raw_text": "You have until midnight – save up to £350 on my favourite Anker portable projectors with these early Prime Day deals. Better be quick – these are the lowest prices we've seen on these well-rated Anker projectors."
  },
  {
    "raw_text": "Forget Prime Day - Best Buy's Techtober sale features up to $1,400 off TVs, appliances, laptops, and more. Best Buy's huge Techtober sale is live - check out our favorite deals on laptops, headphones, TVs, and much more this week."
  },
  {
    "raw_text": "Learning Resources Sorting Snacks Mini Fridge – $12 (reg. $28). Amazon has the Learning Resources Sorting Snacks Mini Fridge – Play Food, Toddler Kitchen, Montessori , Color Sorting Sensory, Gifts for Boys and Girls, Preschool Games, Fine Motor Skills, Counting, Kindergarten on sale for $12 (reg. $28)! This is the best pr…"
  },
  {
    "raw_text": "Searching for a cut-price SSD before Amazon Big Deal Days? This Silicon SSD is super-powerful and has had its price slashed. This Silicon SSD is one of the best mainstream SSDs around - and right now, it's cheaper than ever."
  },
  {
    "raw_text": "MOVA Canada Prime Big Deal Days 2025: Exclusive Robot Vacuum & Smart Home Deals – Up to $500 Off!. Prime Big Deal Days isn’t just about Amazon. MOVA Canada is getting in on the action too—with Prime Day 2025 deals that include steep discounts, bonus points, giveaways, and more. From September 25 to October 10, you can shop MOVA’s robot vacuums, home applia…"
  },
  {
    "raw_text": "Someone Forgot to Tell Amazon About the Xbox Series S Price Jump, Gaming Console and Controller Drops to All-Time Low. On October 3, Xbox Series S prices were announced to rise to $400 but Amazon still has them for $71 less than that.\nThe post Someone Forgot to Tell Amazon About the Xbox Series S Price Jump, Gaming Console and Controller Drops to All-Time Low appeared first o…"
  },
  {
    "raw_text": "[S&S] $35.10*: 30 lbs Eukanuba Adult Small Bites Dry Dog Food at Amazon. Amazon has select Eukanuba Adult and Puppy Dry Dog Food on sale below when you clip the 50% Off coupon on the page and checkout with Subscribe & Save. Shipping is free.\r\n\r\nThanks to Deal Hunter ph"
  },
  {
    "raw_text": "In-store most preferred shopping format, omni-channel retail gains traction for urban India: Survey. Urban Indian shoppers prefer in-store shopping, with a majority excited for festive season sales and online shopping events."
  },
  {
    "raw_text": "In-store most preferred shopping format, omni-channel retail gains traction for urban India: Survey. Urban Indian shoppers prefer in-store shopping, with a majority excited for festive season sales and online shopping events."
  },
  {
    "raw_text": "In Review: Spier & Mackay Brogue Cap Toe Oxfords. Less expensive than Allen Edmonds. Way nicer than cheap department store junk. Up close with Spier's full grain, Blake stitched dress shoes."
  },
  {
    "raw_text": "M3 iPad Air Hits All-Time Low Ahead of Prime Day, Now $150 Off. Apple's sleek but speedy M3 iPad M3 is back to its record-low price at $449 from $599 at Amazon and Best Buy ahead of the Prime Day sale."
  },
  {
    "raw_text": "My favorite outdoor projector is 26% off for Amazon Prime Day. The Yaber T2 projector offers impressive brightness and booming sound for outdoor movie nights. Plus, you can get it for a discount during Prime Day."
  },
  {
    "raw_text": "$19.99*: Apple AirTag Bluetooth Tracking Device at Amazon. Amazon [amazon.com] has *Apple AirTag Bluetooth Tracking Device* for *$19.99*. \n*Shipping is free* with Prime or on $35+ orders. \n \n*Price* \n*$9.01* lower (31% savings) than the list price of *$29*..."
  },
  {
    "raw_text": "I love the Apple Mac mini - and Amazon just cut the price of my number 1 mini PC ahead of its Prime Big Deal Days sale. The most affordable Mac mini right now - don't hold back."
  },
  {
    "raw_text": "Prime Day TV deals are live now – I'm a TV expert, and I'm picking the deals actually worth buying. I've picked bargain TVs from just $99, ranging up to elite OLED TVs and 98-inch mini-LED QLED TVs"
  },
  {
    "raw_text": "Here are the 13 best Apple deals for Amazon's October Prime Day – AirPods, iPads, and MacBooks from $89.99. Prime Day Apple deals are live at Amazon's October sale, and I'm rounding up today's 13 best offers on AirPods, iPads, the Apple Watch, MacBooks, and more."
  },
  {
    "raw_text": "One of my favorite Bluetooth speakers just had its price slashed ahead of Amazon’s Big Deal Days event – and I might have to buy it. The JBL Xtreme 4 can be yours for $100 / £90 less before Amazon's Big Deal Days even kick off."
  },
  {
    "raw_text": "Finally, a Ring doorbell camera I can recommend to most people (especially at this price). The Ring Battery Doorbell Pro is the top-performing, most feature-packed battery Ring doorbell currently available. And it's on sale."
  }
]